{"root":{"element":{"businessId":0,"name":"CheeseCake","authorEmail":"loqjad3103@gmail.com","dishTime":"DINNER","authorName":"Linux Geek","portions":5,"duration":15,"dishType":"DESSERT","difficulty":4,"dishTags":["VEGETARIAN"],"photo":"250-picture","ingredientsList":["Queso Crema;300; gramos","Azucar; 1 ; taza","Galleta Maria;500;gramos","Mantequilla; 150; grams","Huevos; 3; unidades","Natilla; 1; taza","Jalea de Fresa; 1/2; tazas"],"instructions":["Precalentar horno a 350F ","Pulverize la galleta maria y mezclela con la mantequilla y recubra el interior de un molde para queques","Mezcle el queso crema y la azucar hasta que tenga una consistencia suave, agregue los huevos uno a uno, mezclando despues de cada uno","Hornee en el horno precalentado por 50 minutos, espere a que se enfrie por completo antes de remover del molde"],"price":0.0,"id":250,"postTime":1594877067609,"postTimeString":"15/07/2020 23:24","score":4.6666665,"scoreTimes":3,"comments":[],"ratedBy":["g@gmail.com"]},"left":{"element":{"businessId":0,"name":"Huevo Picado","authorEmail":"m@gmail.com","dishTime":"BREAKFAST","authorName":"El Magias Rivera","portions":1,"duration":5,"dishType":"MAIN_DISH","difficulty":2,"dishTags":["VEGETARIAN"],"photo":"86-picture","ingredientsList":["Huevos;2;unidad","Aceite;1;tapa","Sal;1;al gusto"],"instructions":["Romper los huevos","Pone los huevos a freir","Les echa sal y revuelve"],"price":0.0,"id":86,"postTime":1595017586729,"postTimeString":"17/07/2020 14:26","score":0.0,"scoreTimes":0,"comments":[],"ratedBy":[]},"left":{"element":{"businessId":0,"name":"Helado de leche merengada","authorEmail":"m@gmail.com","dishTime":"SNACK","authorName":"El Magias Rivera","portions":5,"duration":5,"dishType":"DESSERT","difficulty":5,"dishTags":["VEGETARIAN"],"photo":"31-picture","ingredientsList":["Leche entera;500;ml","Nata para montar;500;ml","Claras de huevo;4;unidades","Azucar;6;cucharadas soperas","Cascara de limon;1;trozo","Canela;1;rama","Canela en polo;1;cucharada sopera"],"instructions":["Prepara la leche merengada casera. Para ello, pon en un cazo la leche con la rama de canela, las 5 cucharadas de azucar y la cascara de limon. Deja que cueza la leche y, cuando empiece a hervir, baja un poco el fuego, deja que hierva y se infusione con la canela y la cascara de limon unos 10 minutos. Apaga, deja enfriar y metela en la nevera para que se enfrie antes.","Monta ligeramente la nata. Hecho esto, saca la leche de la nevera, quita la rama de canela y la cascara de limon, agrega la nata a la leche y mezcla con unas varillas poco a poco. Puedes usar varillas manuales o electricas.","Bate las claras a punto de nieve. agrega el azucar cuando esten a medio montar y sigue batiendo. Cuando esten bien montadas, como si fuese un merengue suizo, agregalas a la mezcla anterior e integralas con unas varillas manuales para evitar que pierdan su volumen. De esta forma, quedara un helado de leche merengada muy cremoso.","Vierte la mezcla en un recipiente de cristal o en una bandeja metalica que sea apta para el congelador y tenga tapadera. Introduce el recipiente en el congelado y, cada hora, sacalo para remover el helado de leche merengada con unas varillas o un tenedor. Este paso es necesario para evitar que se formen cristales y conseguir que quede mas cremoso. Deberas repetir este proceso unas 3-4 veces cada hora durante 2-4 horas, luego dejalo que se termine de congelar tapado para que no coja olores.","Cuando vayas a servir el helado, sacalo unos minutos antes del congelador para que se descongele ligeramente y este bien cremoso. Prepara los helados con una cuchara o con un saca bolas de helados.","Espolvorea un poco de canela en polvo justo antes de servirlo y decora con unas galletas para helados. Tambien se puede agregar caramelo liquido, chocolate fundido y frutos secos. Asi de sencilla es la receta de helado de leche merengada! Queda cremoso y delicioso y es mucho mas saludable que el industrial."],"price":0.0,"id":31,"postTime":1595130987098,"postTimeString":"18/07/2020 21:56","score":0.0,"scoreTimes":0,"comments":[],"ratedBy":[]},"left":null,"right":null,"height":1},"right":{"element":{"businessId":0,"name":"Quequito simple","authorEmail":"s@gmail.com","dishTime":"SNACK","authorName":"Jichael Mackson","portions":5,"duration":5,"dishType":"DESSERT","difficulty":5,"dishTags":["VEGETARIAN"],"photo":"104-picture","ingredientsList":["Huevo;3;Unidades","Azucar;2;tazas","mantequilla;4;cucharadas soperas","Harina;4;tazas","Leche;1;taza","Ralladura de naranja;1;unidad","Polvo de Hornear;1;cucharadita"],"instructions":["Para empezar a preparar este queque facil, lo primero sera batir el azucar con la mantequilla. El resultado debe ser una crema suave y blanquecina. Puedes usar unas varillas electricas si deseas.","A continuacion, separa las yemas de claras. Primero incorpora las yemas a la mezcla anterior de uno en uno. Esto quiere decir que no echaras la siguiente yema hasta que la primera se haya integrado por completo e masa del queque casero.","Aparte, monta las claras a punto de nieve. Para conseguir una textura consistente agrega una pizca de sal. Cuando esten listas agregalas a la masa del queque facil y esponjoso con movimientos suaves y envolventes, agrega tambien la ralladura de limon. Las claras son el secreto para hacer un bizcocho bien esponjoso y suave.","Para terminar de preparar la masa del queque facil, agrega la harina tamizada mezclada con el polvo de hornear alternando con la leche de forma pausada. Ve agregando estos ingredientes poco a poco mientras continuas batiendo la mezcla. Lo ideal es que no queden grumos en la masa.","Finalmente, engrasa con un poco de mantequilla un molde para horno y vacia toda la mezcla en el. Cocina el queque facil en el horno precalentado a 180 C por 40 minutos. Es importante que no abras el horno durante el proceso de coccion.","Cuando este listo, retira el queque casero, deja que se enfrie y desmoldalo. facil verdad? Puedes hacer una torta decorada con merengue, o puedes complementar tu queque facil con una ganache de chocolate o la cobertura que mas te guste."],"price":0.0,"id":104,"postTime":1595129032514,"postTimeString":"18/07/2020 21:23","score":0.0,"scoreTimes":0,"comments":[],"ratedBy":[]},"left":{"element":{"businessId":1500,"name":"Arroz","authorEmail":"m@gmail.com","dishTime":"LUNCH","authorName":"Las tortas del magias","portions":4,"duration":20,"dishType":"ENTREE","difficulty":2,"dishTags":["VEGAN"],"photo":null,"ingredientsList":["Arroz;4;taza","Aceite;1;tapa","Agua;2.5;taza","Sal;2;cd"],"instructions":["Vertir el aceite en la olla arrocera y prender el interruptor de coccion","Echar el arroz, sal y agua, revolvemos los ingredientes","Tapar la olla y dejar cocinar por aproxidamente 15 minutos"],"price":6.99,"id":99,"postTime":1595387177575,"postTimeString":"21/07/2020 21:06","score":0.0,"scoreTimes":0,"comments":[],"ratedBy":[]},"left":null,"right":null,"height":1},"right":{"element":{"businessId":1500,"name":"Cereal","authorEmail":"m@gmail.com","dishTime":"BREAKFAST","authorName":"Las tortas del magias","portions":1,"duration":3,"dishType":"MAIN_DISH","difficulty":1,"dishTags":["VEGETARIAN"],"photo":null,"ingredientsList":["Cereal;1;taza","Leche;1;taza"],"instructions":["Agregar el cereal en una taza","Vertir la leche en una taza"],"price":2.99,"id":233,"postTime":1595386451965,"postTimeString":"21/07/2020 20:54","score":0.0,"scoreTimes":0,"comments":[],"ratedBy":[]},"left":null,"right":null,"height":1},"height":2},"height":3},"right":{"element":{"businessId":0,"name":"Gallo Pinto","authorEmail":"loqjad3103@gmail.com","dishTime":"BREAKFAST","authorName":"Linux Geek","portions":5,"duration":15,"dishType":"MAIN_DISH","difficulty":2,"dishTags":["VEGAN"],"photo":"500-picture","ingredientsList":["Arroz;1;taza","Frijoles;1;taza","Especies Mixtas;1/2;taza","Lizano, obvio;1;cucharada"],"instructions":["Revolver las varas","Cocinar"],"price":0.0,"id":500,"postTime":1594877067444,"postTimeString":"15/07/2020 23:24","score":3.0,"scoreTimes":1,"comments":[],"ratedBy":[]},"left":{"element":{"businessId":0,"name":"Ragu de cerdo","authorEmail":"s@gmail.com","dishTime":"LUNCH","authorName":"Jichael Mackson","portions":5,"duration":5,"dishType":"MAIN_DISH","difficulty":5,"dishTags":["CARNIVORE"],"photo":"337-picture","ingredientsList":["Carne de Cerdo;1;kg","Zanahoria;2;unidades","Cebolla;1;unidad","dientes de ajo;2;unidades","pimiento verde;1;trozo","Vino blanco; 300;ml","Tomate frito; 100; g","Harina de trigo;4;cucharadas soperas","Aceite;1;cucharada","Pimienta;1;pizca","Sal;1;pizca"],"instructions":["Corta la carne en trozos, quita la grasa y salpimienta al gusto. Intenta que la carne quede en trozos del mismo tamano para que se cocinen por igual.","Reboza la carne pasandola por la harina, asi quedara mas jugosa por dentro.","Pica la cebolla y los dientes de ajo previamente pelados. Dado que el ragu de cerdo se presta a variaciones, puedes sumar otros ingredientes que te gusten, como puerro.","Pon una cazuela al fuego con un buen chorro de aceite de oliva, agrega la carne y deja que se dore. A medio dorar, agrega la cebolla y los ajos picados.","Mientras se dora un poco la cebolla con la carne, corta el resto de verduras, es decir, la zanahoria y el pimiento verde. Nuevamente, puedes sumar otros ingredientes al ragu de cerdo, como pimiento rojo o patata.","Incorpora la zanahoria y el pimiento, remueve y deja que se cocine todo junto unos minutos, teniendo cuidado de que no se queme la cebolla.","agrega el tomate frito, remueve y sigue cocinando. Si lo prefieres, puedes triturar un par de tomates naturales y usarlos en lugar del tomate frito.","Vierte el vaso de vino blanco, deja que hierva y se evapore el alcohol. Al tratarse de una receta de ragu de cerdo, el vino blanco combina mejor. Ahora bien, si por ejemplo hicieras ragu de ternera, podrias utilizar vino tinto para realizar su sabor.","Cubre la carne con agua o caldo de verduras y deja que se cocine a fuego lento alrededor de una hora. Pasado el tiempo, prueba de sal y pimienta y rectifica si es necesario. Deja cocinar unos 30 minutos mas para que todos los sabores acaben de integrarse y la carne quede bien tierna. Si hiciera falta, puedes agregar mas agua o caldo.","Cuando veas que la carne esta tierna y la salsa bien consistente, apaga el fuego. Si tienes tiempo suficiente, deja reposar la carne para que coja todos los sabores y quede mas buena. Como hemos dicho al principio, lo ideal seria hacer este plato de un dia para otro para que se asiente y quede mucho mas sabroso. No obstante, servido inmediatamente tambien esta delicioso. Disfruta de tu receta de ragu de cerdo y no olvides contarnos que te ha parecido. Recuerda que tambien puedes hacer ragu de cerdo con patatas agregando este ingrediente al guiso o cocinandolo aparte."],"price":0.0,"id":337,"postTime":1595129849018,"postTimeString":"18/07/2020 21:37","score":0.0,"scoreTimes":0,"comments":[],"ratedBy":[]},"left":null,"right":null,"height":1},"right":{"element":{"businessId":1637,"name":"Vaca negra","authorEmail":"loqjad3103@gmail.com","dishTime":"SNACK","authorName":"Chuletas Don Jean","portions":1,"duration":5,"dishType":"DESSERT","difficulty":1,"dishTags":["VEGETARIAN"],"photo":null,"ingredientsList":["Coca Cola;600;ml","Helados;1;al gusto"],"instructions":["Agarrar un vaso","Agregar los helados en el vaso","Vertir la coca cola"],"price":2.99,"id":726,"postTime":1595394886678,"postTimeString":"21/07/2020 23:14","score":0.0,"scoreTimes":0,"comments":[],"ratedBy":[]},"left":null,"right":null,"height":1},"height":2},"height":4},"empty":false}